# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

quantity_paper_cranes = int(input())

Peter_cranes = quantity_paper_cranes//6
Serg_cranes = Peter_cranes
Kate_cranes = Peter_cranes*4

print(Peter_cranes, Kate_cranes, Serg_cranes)
